app/views/rooms/get_search_rooms.html.erb

SELECT "bookedrooms".* FROM "bookedrooms" WHERE (room_id=1234) AND (booking_time = '2016-10-24 00:00:00' or booking_time = '2016-10-24 01:00:00' or booking_time = '2016-10-23 23:00:00')
SELECT "rooms".* FROM "rooms" WHERE (building = 'hunt' AND size = '4') AND (status = 'booked')
---
        <td><%= room.status %></td>
        <td><%= link_to_if (room.status == 'available' and Bookedroom.find_by(user_id: @id ).blank?), 'Book', confirm_booking_path(:id => room.roomno, :date=>@date) %></td>