app/controllers/bookedrooms_controller.rb

SELECT "bookedrooms".* FROM "bookedrooms"
---
  def index
    @bookedrooms = Bookedroom.all

DELETE FROM "bookedrooms" WHERE "bookedrooms"."id" = ?  [["id", 7]]
---
  def destroy
    @bookedroom.destroy

SELECT  "bookedrooms".* FROM "bookedrooms" WHERE "bookedrooms"."id" = ? LIMIT ?  [["id", 1231], ["LIMIT", 1]]
SELECT  "rooms".* FROM "rooms" WHERE (roomno = 1231) LIMIT ?  [["LIMIT", 1]]
---
    def set_bookedroom
      @bookedroom = Bookedroom.find(params[:id])