app/controllers/rooms_controller.rb

  def book_room

    booked_room=Bookedroom.new(:user_id=>session[:current_user_id],:room_id=>params[:id],:status=>'booked',:booking_time=>params[:date].to_datetime.in_time_zone('UTC'))
    respond_to do |format|
      if booked_room.save
---
INSERT INTO "bookedrooms" ("user_id", "room_id", "booking_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["room_id", 1231], ["booking_time", 2016-09-24 01:00:00 -0400], ["created_at", 2016-09-23 18:14:10 -0400], ["updated_at", 2016-09-23 18:14:10 -0400]]

  def get_search_rooms
    @room=Room.new(room_params)
    date=Time.new(@room.date[1].to_i, @room.date[2].to_i,
                             @room.date[3].to_i, @room.date[4].to_i,
                             @room.date[5].to_i)
    @date=date
    @room.date=date
    if date.past?
      redirect_to search_rooms_path, notice: 'Please Enter current or future Date.'

    else
      conditions = []
      conditions << "roomno = #{@room.roomno}" if @room.roomno !=nil
      conditions << "building = '#{@room.building}'"
      conditions << "size = '#{@room.size}'"

      @rooms = Room.where(conditions.join(" AND "))
      @rooms.each do |room|
        room.date=date
        list_of_booked_rooms=Bookedroom.where("room_id=?",room.roomno)
---
SELECT "rooms".* FROM "rooms" WHERE (building = 'hunt' AND size = '4') AND (status = 'booked')
SELECT "bookedrooms".* FROM "bookedrooms" WHERE (room_id=1234) AND (booking_time = '2016-10-24 00:00:00' or booking_time = '2016-10-24 01:00:00' or booking_time = '2016-10-23 23:00:00')