app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "anudeepvrm@gmail.com"], ["LIMIT", 1]]
---
  def validatelogin
    @user=User.new(user_params)

    if @user.exist?
      User.select(@user.email)

INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "lol"], ["email", "lol@gmail.com"], ["password", "9741899346"], ["created_at", 2016-09-24 13:52:54 -0400], ["updated_at", 2016-09-24 13:52:54 -0400]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save