app/views/bookedrooms/get_active_rooms.html.erb

SELECT  "rooms".* FROM "rooms" WHERE (roomno = 1231) LIMIT ?  [["LIMIT", 1]]
---
      <tr>
        <%@temp_room=Room.where("roomno = ?",bookedroom.room_id).take%>